---
kind: type
id: T:Autodesk.Revit.DB.SolidOrShellTessellationControls
source: html/ab0dd37a-7ed8-4874-2861-0f9a41da0235.htm
---
# Autodesk.Revit.DB.SolidOrShellTessellationControls

Controls various aspects of the triangulation produced by [!:SolidUtils::tessellateSolidOrShell()] method.

## Syntax (C#)
```csharp
public class SolidOrShellTessellationControls : IDisposable
```